$(function(){
    function getQueryString(name) {
        var reg = new RegExp("(^|&)" + name + "=([^&]*)(&|$)", "i");
        var r = window.location.search.substr(1).match(reg);
        if (r != null) return unescape(r[2]);
        return null;
    }
    var num = getQueryString("id") || 0;
    new Vue({
        el:'#activityDetailPage',
        data: {
            detail: [
                {
                    id:'1',
                title: '<h1>公益课堂国学礼</h1>' +
                    '<h3>国学书香公益行</h3>' +
                    '<p>为了发扬中国传统文化，继承中华文明礼仪知识普及，明志书院特举办本次公益活动——“国学礼仪课堂”，让更多的中国人感受到礼仪之美，国之精粹。' +
                    '本次明志书院教师团队来到了位于钱塘江畔校区—— <strong>杭州市杨绫子学校</strong>' +
                    '这是一所专门为特殊儿童开办的学校，在校学生大多存在着行为障碍或智力障碍。' +
                    '书院此行也是本着人文关怀主义，传播中华传统文化，努力为特殊儿童能拥有公平发展机会贡献自己的一份绵薄之力，让他们也能够和同龄人一样愉快地学习和玩耍，建立积极的自我形象，融入社会，创造丰富人生。</p>' +
                    '<img src="images/gongyi01.jpg"><img src="images/gongyi02.jpg">' +
                    '<h3>一、正衣冠</h3>' +
                    '<p>"衣冠"不仅仅是遮羞，更重要的是反映孩子们的精神面貌，这正是"童蒙之学，始于衣冠;先正衣冠，后明事理"。</p>' +
                    '<img src="images/gongyi03.jpg">' +
                    '<h3>二、拜孔礼</h3>' +
                    '<p>" 鞠躬行礼"是教孩子们学会感恩，尊重师长。</p>' +
                    '<img src="images/gongyi04.jpg">' +
                    '<h3>三、朱砂启智</h3>' +
                    '<p>点红痣，“痣”通“智”，从今开启智慧，告别蒙昧，立下志向、眼明心亮，勤奋读书。</p>' +
                    '<img src="images/gongyi05.jpg">' +
                    '<h3>四、诵读弟子规</h3>' +
                    '<p>弟子规是中华民族道德文明的根基，是待人、接物、求学、做事的基本行为准则，是我们国学必学的经典之作。</p>' +
                    '<img src="images/gongyi06.jpg">' +
                    '<h3>五、识人写人字</h3>' +
                    '<p>人字要端正，就像做人要堂堂正正，有道德讲礼貌。</p>' +
                    '<img src="images/gongyi07.jpg"><img src="images/gongyi08.jpg"><img src="images/gongyi09.jpg"><img src="images/gongyi10.jpg">' +
                    '<p>国学是我们民族文化的精髓，承载着道德伦理观、人生价值观，构成了中华传统文化的核心价值体系，是中华文化最深厚的根基，是数千年来先人留给我们最宝贵的历史文化遗产。</p>' +
                    '<p>文化之国，礼仪之邦，明志书院今后也会不断推出国学礼仪相关活动，促进学员对国学礼仪相关知识的认知，培养品行端正、自强不息、革故鼎新的中华少年。</p>'

            },
                {
                    id:'2',
                    title:'<h1>“国学礼仪课堂”圆满结束</h1>' +
                        '<h3>明志书院成功举办秋季“国学礼仪课堂”</h3>' +
                        '<p>为了发扬中国传统文化，继承中华文明礼仪，明志书院特举办国学礼仪课堂，让更多的国人感受到中华礼仪的艺术魅力，体会中华礼仪之美。</p>' +
                        '<img src="images/guoxueliyi01.jpg">' +
                        '<h3>一、着汉服，正衣冠</h3>' +
                        '<img src="images/guoxueliyi02.jpg">' +
                        '<h3>二、拜孔礼</h3>' +
                        '<img src="images/guoxueliyi03.jpg">' +
                        '<h3>三、朱砂启智</h3>' +
                        '<img src="images/guoxueliyi04.jpg">' +
                        '<h3>四、诵读弟子规</h3>' +
                        '<img src="images/guoxueliyi05.jpg">' +
                        '<h3>五、识人写人字</h3>' +
                        '<img src="images/guoxueliyi06.jpg">' +
                        '<h3>六、敬茶</h3>' +
                        '<img src="images/guoxueliyi07.jpg">' +
                        '<p>国学是我们民族文化的精髓，承载着道德伦理观、人生价值观，构成了中华传统文化的核心价值体系，是中华文化最深厚的根基，是数千年来先人留给我们最宝贵的历史文化遗产。</p>' +
                        '<p>文化之国，礼仪之邦，明志书院今后也会不断推出国学礼仪相关活动，促进学员对国学礼仪相关知识的认知，培养品行端正、自强不息、革故鼎新的中华少年。</p>'


                },
                {
                    id:'3',
                    title:'<h1>九月十六，皮影含情</h1>' +
                        '<h3 style="    text-align: center;">九月十六日下午三点至四点半，明志书院为您演绎不一样的光影人生。</h3>' +
                        '<div>三尺生绢做戏台，全凭十指逞诙谐。</div>' +
                        '<div>有时明月灯窗下，一笑还从掌握来。</div>' +
                        '<span>假亦真时真亦假</span>' +
                        '<h3>起源</h3>' +
                        '<p>皮影戏，又称“影子戏”或“灯影戏”，是一种以兽皮或纸板做成的人物剪影以表演故事的民间戏剧。表演时，艺人们在白色幕布后面，一边操纵影人，一边用当地流行的曲调讲述故事，同时配以打击乐器和弦乐，有浓厚的乡土气息。其流行范围极为广泛，并因各地所演的声腔不同而形成多种多样的皮影戏。</p>' +
                        '<p>皮影戏是中国民间古老的传统艺术，老北京人都叫它“驴皮影”。据史书记载，皮影戏始于西汉，兴于唐朝，盛于清代，元代时期传至西亚和欧洲，可谓历史悠久，源远流长。</p>' +
                        '<p>2011年，中国皮影戏入选人类非物质文化遗产代表作名录。</p>' +
                        '<img src="images/piying01.jpg">' +
                        '<h3>制作工艺</h3>' +
                        '<p>中国地域广阔，各地的皮影都有自己的特色，但是皮影的制作程序大多相同，通常要经过选皮、制皮、画稿、过稿、镂刻、敷彩、发汗熨平、缀结合成等八道工序、手工雕刻3000余刀，是一个复杂奇妙的过程。皮影的艺术创意汲取了中国汉代帛画、画像石、画像砖和唐、宋寺院壁画之手法与风格。</p>' +
                        '<img src="images/piying02.jpg">' +
                        '<h3>艺术流派</h3>' +
                        '<p>由于皮影戏在中国流传地域广阔，在不同区域的长期演化过程中，形成了不同流派，常见有四川皮影、湖北皮影、湖南皮影、北京皮影、唐山皮影、山东皮影、山西皮影、青海皮影、宁夏皮影、陕西皮影，以及川北皮影、陇东皮影等风格各具特色的地方皮影。各地皮影的音乐唱腔风格与韵律都吸收了各自地方戏曲、曲艺、民歌小调、音乐体系的精华，从而形成了溢彩纷呈的众多流派。有沔阳皮影戏、唐山皮影戏、冀南皮影戏、孝义皮影戏、复州皮影戏、海宁皮影戏、陆丰皮影戏、华县皮影戏、华阴老腔、阿宫腔、弦板腔、环县道情皮影戏、凌源皮影戏等等。</p>' +
                        '<img src="images/piying03.jpg">' +
                        '<p>皮影戏的演出，有历史演义戏、民间传说戏、武侠公案戏、爱情故事戏、神话寓言戏、时装现代戏等等，无所不有。折子戏、单本戏和连本戏的剧目繁多，数不胜数。常见的传统剧目有白蛇传、拾玉镯、西厢记、秦香莲、牛郎织女、杨家将、岳飞传、水浒传、三国演义、西游记、封神榜等等。从革命战争年代起到解放后，新发展出的时装戏、现代戏和童话寓言剧，常见的剧目有兄妹开荒、白毛女、刘胡兰、小二黑结婚、小女婿、林海雪原、红灯记、龟与鹤、两朋友、东郭先生等等。</p>' +
                        '<img src="images/piying04.jpg"><img src="images/piying05.jpg"><img src="images/piying06.jpg">'
                },

                {
                    id:'4',
                    title:'<h1>“庆端午”趣味主题活动圆满结束！</h1>' +
                        '<h3>庆端午”趣味主题活动圆满结束！</h3>' +
                        '<p>今天的明志书院格外热闹' +
                        '有关注我们的朋友一定知道！' +
                        '今天在这里举办了一场' +
                        '“庆端午”趣味主题活动' +
                        '大家是不是很好奇' +
                        '小明和他的小伙伴们为大家' +
                        '都策划了些什么有趣味活动呢？' +
                        '现在让小明带你进入明志书院' +
                        '看看我们可爱的小朋友们吧~</p>' +
                        '<img src="images/duanwu01.jpg">' +
                        '<h3>活动第一步 国学入学礼</h3>' +
                        '<p>穿漢服，正衣冠</p>' +
                        '<p>拜先聖，行師禮</p>' +
                        '<p>點朱砂，啟智慧</p>' +
                        '<p>瞧，这位小朋友笑得多开心，智慧不可挡呀</p>' +
                        '<img src="images/duanwu02.jpg">' +
                        '<img src="images/duanwu03.jpg">' +
                        '<img src="images/duanwu04.jpg">' +
                        '<img src="images/duanwu05.jpg">' +
                        '<img src="images/duanwu06.jpg">' +
                        '<img src="images/duanwu07.jpg">' +
                        '<img src="images/duanwu08.jpg">' +
                        '<img src="images/duanwu09.jpg">' +
                        '<h3>第二步，寻找包粽子小能手</h3>' +
                        '<p>国画王老师开始教大家包粽子</p>' +
                        '<p>家长们也迫不及待得进入包粽子队伍</p>' +
                        '<p>体验合作的乐趣</p>' +
                        '<p>成果展示第一波~</p>' +
                        '<p>成果展示第二波~</p>' +
                        '<p>成果展示第三波~</p>' +
                        '<p>不禁让人流出了口水~</p>' +
                        '<p>成果展示第四波~小朋友们包的粽子颜值都很高呢</p>' +
                        '<img src="images/duanwu10.jpg">' +
                        '<img src="images/duanwu11.jpg">' +
                        '<img src="images/duanwu12.jpg">' +
                        '<img src="images/duanwu13.jpg">' +
                        '<img src="images/duanwu14.jpg">' +
                        '<img src="images/duanwu15.jpg">' +
                        '<img src="images/duanwu16.jpg">' +
                        '<h3>第三步 看谁心灵手巧</h3>' +
                        '<p>满墙的字谜，对于智慧之门开启之后的小朋友们就是小菜一碟</p>' +
                        '<p>郑老师教大家编五彩手绳</p>' +
                        '<p>瞧~这是我们美丽的吕老师呀！</p>' +
                        '<img src="images/duanwu17.jpg">' +
                        '<img src="images/duanwu18.jpg">' +
                        '<h3>第四步  画国画</h3>' +
                        '<p>端午节国画主题课，由我们资深的庄老师亲授，赢得了家长和孩子们的一致好评。</p>' +
                        '<p>看到这里是不是心里冒出了一个想法</p>' +
                        '<img src="images/duanwu19.jpg">' +
                        '<img src="images/duanwu20.jpg">' +
                        '<img src="images/duanwu21.jpg">' +
                        '<p>“好想参加呀！”</p>' +
                        '<p>没关系</p>' +
                        '<p>如果还有更多的孩子想融入我们这个大家庭</p>' +
                        '<p>和我们一起学习国学传统文化</p>' +
                        '<p>明志书院会是您最好的选择</p>' +
                        '<p>在这里过上一个美好快乐的童年</p>' +
                        '<p>同时我们也会为大家献上好礼</p>' +
                        '<p>看！</p>' +
                        '<p>明志书院限量版主题课！</p>' +
                        '<p>8节课仅售39元！</p>' +
                        '<p>仅限5个名额</p>' +
                        '<p>截止日期2017年6月1日</p>' +
                        '<p>行动起来吧~</p>'

                },
                {
                    id:'5',
                    title:'<h1>神笔“码”良——国画和编程的完美结合</h1>' +
                        '<p>2018，明志书院最新出炉的活动来啦！这一次，我们将我们传统的国画与现代的Scratch编程结合，设计了本次的活动。小学员们报名以后呀，除了能够学习国画还能通过编程，让自己的作品“动”起来，是不是听着就感觉非常棒了呢？那一起和小明来了解这次活动吧！</p>' +
                        '<p> 杭州明志书院是一家以传承、弘扬中华传统文化为特色的民营幼儿及青少年教育机构。</p>' +
                        '<p> 本机构以文化传承与转化为核心，以艺术教育为特色，文以化人、艺以载道，培养品行端正、自强不息、革故鼎新的中华少年。明志书院遵从“明德至诚，博学笃志”的校训，专注于幼儿至成人的“琴、棋、书、画”等艺术系列课程的培训。</p>' +
                        '<p>明志书院拥有学养深厚的专业教师团队，拥有严谨且创新的课程体系，拥有贴心而完善的教学服务。中华文明如珠似玉，拥有这样的民族瑰宝而不去传承是我们最大的损失，而对孩子的启蒙尤为重要，让孩子从小感受中华文明之美是我们不变的宗旨。</p>' +
                        '<img src="images/maliang01.jpg">' +
                        '<p>乐码教育与浙江大学计算机团队合作，以Scratch软件为基础，自主研发了一系列少儿编程课程，摒弃轻实践重理论的传统思想，通过理论与实战结合的方式，让学生从各个方面理解人工智能时代的发展趋势。</p>' +
                        '<h1>活动介绍</h1>'+
                        '<img src="images/maliang02.jpeg">'
                }
            ],
            num:num
        },

    })

})